In [43]:
import pandas as pd
import numpy as np
#https://www.kaggle.com/datasets/slmsshk/bollywood-release-movie-dataset
df = pd.read_csv("movie_data.csv")
df["Release Date"] = pd.to_datetime(df["Release Date"])
df.head()

  Movie Name Release Date Opening Day Opening Weekend End of Week 1 Lifetime
0    Samadhi   1950-01-01    0 Cr N.A        0 Cr N.A      0 Cr N.A  0.75 Cr
1      Babul   1950-01-01    0 Cr N.A        0 Cr N.A      0 Cr N.A  0.70 Cr
2     Awaara   1951-01-01    0 Cr N.A        0 Cr N.A      0 Cr N.A  1.25 Cr
3     Albela   1951-01-01    0 Cr N.A        0 Cr N.A      0 Cr N.A  0.90 Cr
4      Baazi   1951-01-01    0 Cr N.A        0 Cr N.A      0 Cr N.A     1 Cr

In [21]:
df[df["Release Date"]==pd.Timestamp("1950-01-01")]

  Movie Name Release Date Opening Day Opening Weekend End of Week 1 Lifetime
0    Samadhi   1950-01-01    0 Cr N.A        0 Cr N.A      0 Cr N.A  0.75 Cr
1      Babul   1950-01-01    0 Cr N.A        0 Cr N.A      0 Cr N.A  0.70 Cr

In [30]:
df["Lifetime"].describe()

count         3414
unique        1559
top       0.001 Cr
freq           179
Name: Lifetime, dtype: object

In [41]:
how_many_days = df["Release Date"].max() - df["Release Date"].min()
years = 365
how_many_years = round(how_many_days.days/years,2)
how_many_years

73.54

In [57]:
most_frequent_value = df["Movie Name"].value_counts().idxmax()
count = df["Movie Name"].value_counts()
count = count.max()
print("The most common value:",most_frequent_value)
print("The number of repetitions:",count)

The most common value: Aankhen
The number of repetitions: 3